Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/sha.h
/* -------- SHA_IODATAR : (SHA Offset: 0x80) (R/W 32) Input/Output Data 0 Register -------- */
#define SHA_IODATAR_IODATA_Pos                _UINT32_(0)                                          /* (SHA_IODATAR) Input/Output Data Position */
#define SHA_IODATAR_IODATA_Msk                (_UINT32_(0xFFFFFFFF) << SHA_IODATAR_IODATA_Pos)     /* (SHA_IODATAR) Input/Output Data Mask */
#define SHA_IODATAR_IODATA(value)             (SHA_IODATAR_IODATA_Msk & (_UINT32_(value) << SHA_IODATAR_IODATA_Pos)) /* Assigment of value for IODATA in the SHA_IODATAR register */
#define SHA_IODATAR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (SHA_IODATAR) Register Mask  */


/* -------- SHA_WPMR : (SHA Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SHA_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (SHA_WPMR) Write Protection Configuration Enable Position */
#define SHA_WPMR_WPEN_Msk                     (_UINT32_(0x1) << SHA_WPMR_WPEN_Pos)                 /* (SHA_WPMR) Write Protection Configuration Enable Mask */
#define SHA_WPMR_WPEN(value)                  (SHA_WPMR_WPEN_Msk & (_UINT32_(value) << SHA_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the SHA_WPMR register */
#define SHA_WPMR_WPITEN_Pos                   _UINT32_(1)                                          /* (SHA_WPMR) Write Protection Interruption Enable Position */
#define SHA_WPMR_WPITEN_Msk                   (_UINT32_(0x1) << SHA_WPMR_WPITEN_Pos)               /* (SHA_WPMR) Write Protection Interruption Enable Mask */
#define SHA_WPMR_WPITEN(value)                (SHA_WPMR_WPITEN_Msk & (_UINT32_(value) << SHA_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the SHA_WPMR register */
#define SHA_WPMR_WPCREN_Pos                   _UINT32_(2)                                          /* (SHA_WPMR) Write Protection Control Enable Position */
#define SHA_WPMR_WPCREN_Msk                   (_UINT32_(0x1) << SHA_WPMR_WPCREN_Pos)               /* (SHA_WPMR) Write Protection Control Enable Mask */
#define SHA_WPMR_WPCREN(value)                (SHA_WPMR_WPCREN_Msk & (_UINT32_(value) << SHA_WPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the SHA_WPMR register */
#define SHA_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (SHA_WPMR) Write Protection Key Position */
#define SHA_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << SHA_WPMR_WPKEY_Pos)           /* (SHA_WPMR) Write Protection Key Mask */
#define SHA_WPMR_WPKEY(value)                 (SHA_WPMR_WPKEY_Msk & (_UINT32_(value) << SHA_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the SHA_WPMR register */
#define   SHA_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x534841)                                   /* (SHA_WPMR) Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0.  */
#define SHA_WPMR_WPKEY_PASSWD                 (SHA_WPMR_WPKEY_PASSWD_Val << SHA_WPMR_WPKEY_Pos)    /* (SHA_WPMR) Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0. Position  */
#define SHA_WPMR_Msk                          _UINT32_(0xFFFFFF07)                                 /* (SHA_WPMR) Register Mask  */


/* -------- SHA_WPSR : (SHA Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define SHA_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (SHA_WPSR) Write Protection Violation Status (cleared on read) Position */
#define SHA_WPSR_WPVS_Msk                     (_UINT32_(0x1) << SHA_WPSR_WPVS_Pos)                 /* (SHA_WPSR) Write Protection Violation Status (cleared on read) Mask */
#define SHA_WPSR_WPVS(value)                  (SHA_WPSR_WPVS_Msk & (_UINT32_(value) << SHA_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the SHA_WPSR register */
#define SHA_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (SHA_WPSR) Write Protection Violation Source Position */
#define SHA_WPSR_WPVSRC_Msk                   (_UINT32_(0xFF) << SHA_WPSR_WPVSRC_Pos)              /* (SHA_WPSR) Write Protection Violation Source Mask */
#define SHA_WPSR_WPVSRC(value)                (SHA_WPSR_WPVSRC_Msk & (_UINT32_(value) << SHA_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the SHA_WPSR register */
#define SHA_WPSR_Msk                          _UINT32_(0x0000FF01)                                 /* (SHA_WPSR) Register Mask  */


/** \brief SHA register offsets definitions */
#define SHA_CR_REG_OFST                _UINT32_(0x00)      /* (SHA_CR) Control Register Offset */
#define SHA_MR_REG_OFST                _UINT32_(0x04)      /* (SHA_MR) Mode Register Offset */
#define SHA_IER_REG_OFST               _UINT32_(0x10)      /* (SHA_IER) Interrupt Enable Register Offset */
#define SHA_IDR_REG_OFST               _UINT32_(0x14)      /* (SHA_IDR) Interrupt Disable Register Offset */
#define SHA_IMR_REG_OFST               _UINT32_(0x18)      /* (SHA_IMR) Interrupt Mask Register Offset */
#define SHA_ISR_REG_OFST               _UINT32_(0x1C)      /* (SHA_ISR) Interrupt Status Register Offset */
#define SHA_MSR_REG_OFST               _UINT32_(0x20)      /* (SHA_MSR) Message Size Register Offset */
#define SHA_BCR_REG_OFST               _UINT32_(0x30)      /* (SHA_BCR) Bytes Count Register Offset */
#define SHA_IDATAR_REG_OFST            _UINT32_(0x40)      /* (SHA_IDATAR) Input Data 0 Register Offset */
#define SHA_IDATAR0_REG_OFST           _UINT32_(0x40)      /* (SHA_IDATAR0) Input Data 0 Register Offset */
#define SHA_IDATAR1_REG_OFST           _UINT32_(0x44)      /* (SHA_IDATAR1) Input Data 0 Register Offset */
#define SHA_IDATAR2_REG_OFST           _UINT32_(0x48)      /* (SHA_IDATAR2) Input Data 0 Register Offset */
#define SHA_IDATAR3_REG_OFST           _UINT32_(0x4C)      /* (SHA_IDATAR3) Input Data 0 Register Offset */
#define SHA_IDATAR4_REG_OFST           _UINT32_(0x50)      /* (SHA_IDATAR4) Input Data 0 Register Offset */
#define SHA_IDATAR5_REG_OFST           _UINT32_(0x54)      /* (SHA_IDATAR5) Input Data 0 Register Offset */
#define SHA_IDATAR6_REG_OFST           _UINT32_(0x58)      /* (SHA_IDATAR6) Input Data 0 Register Offset */
#define SHA_IDATAR7_REG_OFST           _UINT32_(0x5C)      /* (SHA_IDATAR7) Input Data 0 Register Offset */
#define SHA_IDATAR8_REG_OFST           _UINT32_(0x60)      /* (SHA_IDATAR8) Input Data 0 Register Offset */
#define SHA_IDATAR9_REG_OFST           _UINT32_(0x64)      /* (SHA_IDATAR9) Input Data 0 Register Offset */
#define SHA_IDATAR10_REG_OFST          _UINT32_(0x68)      /* (SHA_IDATAR10) Input Data 0 Register Offset */
#define SHA_IDATAR11_REG_OFST          _UINT32_(0x6C)      /* (SHA_IDATAR11) Input Data 0 Register Offset */
#define SHA_IDATAR12_REG_OFST          _UINT32_(0x70)      /* (SHA_IDATAR12) Input Data 0 Register Offset */
#define SHA_IDATAR13_REG_OFST          _UINT32_(0x74)      /* (SHA_IDATAR13) Input Data 0 Register Offset */
#define SHA_IDATAR14_REG_OFST          _UINT32_(0x78)      /* (SHA_IDATAR14) Input Data 0 Register Offset */
#define SHA_IDATAR15_REG_OFST          _UINT32_(0x7C)      /* (SHA_IDATAR15) Input Data 0 Register Offset */
#define SHA_IODATAR_REG_OFST           _UINT32_(0x80)      /* (SHA_IODATAR) Input/Output Data 0 Register Offset */
#define SHA_IODATAR0_REG_OFST          _UINT32_(0x80)      /* (SHA_IODATAR0) Input/Output Data 0 Register Offset */
#define SHA_IODATAR1_REG_OFST          _UINT32_(0x84)      /* (SHA_IODATAR1) Input/Output Data 0 Register Offset */
#define SHA_IODATAR2_REG_OFST          _UINT32_(0x88)      /* (SHA_IODATAR2) Input/Output Data 0 Register Offset */
#define SHA_IODATAR3_REG_OFST          _UINT32_(0x8C)      /* (SHA_IODATAR3) Input/Output Data 0 Register Offset */
#define SHA_IODATAR4_REG_OFST          _UINT32_(0x90)      /* (SHA_IODATAR4) Input/Output Data 0 Register Offset */
#define SHA_IODATAR5_REG_OFST          _UINT32_(0x94)      /* (SHA_IODATAR5) Input/Output Data 0 Register Offset */
#define SHA_IODATAR6_REG_OFST          _UINT32_(0x98)      /* (SHA_IODATAR6) Input/Output Data 0 Register Offset */
#define SHA_IODATAR7_REG_OFST          _UINT32_(0x9C)      /* (SHA_IODATAR7) Input/Output Data 0 Register Offset */
#define SHA_IODATAR8_REG_OFST          _UINT32_(0xA0)      /* (SHA_IODATAR8) Input/Output Data 0 Register Offset */
#define SHA_IODATAR9_REG_OFST          _UINT32_(0xA4)      /* (SHA_IODATAR9) Input/Output Data 0 Register Offset */
#define SHA_IODATAR10_REG_OFST         _UINT32_(0xA8)      /* (SHA_IODATAR10) Input/Output Data 0 Register Offset */
#define SHA_IODATAR11_REG_OFST         _UINT32_(0xAC)      /* (SHA_IODATAR11) Input/Output Data 0 Register Offset */
#define SHA_IODATAR12_REG_OFST         _UINT32_(0xB0)      /* (SHA_IODATAR12) Input/Output Data 0 Register Offset */
#define SHA_IODATAR13_REG_OFST         _UINT32_(0xB4)      /* (SHA_IODATAR13) Input/Output Data 0 Register Offset */
#define SHA_IODATAR14_REG_OFST         _UINT32_(0xB8)      /* (SHA_IODATAR14) Input/Output Data 0 Register Offset */
#define SHA_IODATAR15_REG_OFST         _UINT32_(0xBC)      /* (SHA_IODATAR15) Input/Output Data 0 Register Offset */
#define SHA_WPMR_REG_OFST              _UINT32_(0xE4)      /* (SHA_WPMR) Write Protection Mode Register Offset */
#define SHA_WPSR_REG_OFST              _UINT32_(0xE8)      /* (SHA_WPSR) Write Protection Status Register Offset */

